hacker/_posts/2016-10-09-Automatic Prodigy Process Binding.org
#+OPTIONS: H:2 num:nil tags:nil timestamps:t
#+BEGIN_EXPORT html
---
title: Automatic Prodigy Process Binding
tagline: Automatically process buffer key binding with prodigy
layout: post
author: Francis Murillo
categories: Experiment, Hacker
blog-category: hacker
tags: Emacs
---
#+END_EXPORT

* Preface

  It's been quite a long time since I made another post. I have been
  quite busy with making an app and making a presentation for my
  functional programming group which really ate my attention and
  creativity. So for now, let's see what I can come up with a smaller
  piece than what I have done before.

* Problem

  If you have been using [[https://github.com/rejeep/prodigy.el][prodigy.el]], you might get curious on the output
  buffer of your services. Assuming you have started the service, there
  are two easy ways to check the process buffer out

  - =switch-to-buffer=
       The default way to find any buffer. Whether you use [[https://github.com/emacs-helm/helm][helm]] or [[https://github.com/abo-abo/swiper][ivy]]
       or some buffer management technique, you filter out the name of
       the process buffer and go.

  - =prodigy=
       The canonical way of finding the process buffers. Once in this
       menu buffer, you can search for your process buffer and hit
       =$= (or =prodigy-display-process=)

  But nothing beats a key binding in both scenarios(, unless you can't
  memorize key bindings.) So what we want is *when we create a service,
  we want a key binding associated to opening it's process buffer*. Easy
  right?

  I filed an [[https://github.com/rejeep/prodigy.el/issues/90][issue]] for it but I doubt it would be opened so here I am
  telling you about it. If you don't want a boring story as usual, here
  is the [[https://gist.github.com/FrancisMurillo/97eac4b41ef7aa2365bf32a3cac1157c][code]]. Otherwise, let's get down with the short details.

* Decorating The Constructor

  So in making services, how do we make one? The function is
  =prodigy-define-service=. Let's define one.

  #+BEGIN_SRC emacs-lisp
    (prodigy-define-service
      :name "server"
      :command "jekyll"
      :args '("serve")
      :cwd "~/Fakespace/fnlog.io")

    (prodigy-start-service (prodigy-find-service "server"))
  #+END_SRC

  At the time of writing, this is my minimal [[https://jekyllrb.com/][jekyll]] prodigy service to
  serve my blog and to automatically start when it is defined which is
  another [[https://github.com/rejeep/prodigy.el/issues/38][feature]] that I desire. Okay, so how do we go about customizing
  the constructor? There are two ways again.

  - Make a custom function constructor

    This is a safe approach and probably one should lead toward.

    #+BEGIN_SRC emacs-lisp
      (defun fn/prodigy-define-service (&rest args)
        "A wrapper for `prodigy-define-service' with automatic bindings."
        (let ((service (apply #'prodigy-define-service args)))
          (prog1
              service
            ;; Here is where we strike
            )))
    #+END_SRC

    Nothing wrong with this approach. But if you're like me, you sense
    this is more *function decorating* than anything else; then you will
    tend to the other way.

  - Advice the constructor

    Using the benevolent =advice-add= construct.

    #+BEGIN_SRC emacs-lisp
      (defun fn/prodigy-define-service-bind-hook (orig-fun &rest args)
        "When creating a service, check for a :bind keyword to create an automatic keybinding for it."
        (let ((result (apply orig-fun args)))
          (prog1
              result
            ;; Attack here again
            )))

      (advice-add #'prodigy-define-service :around #'fn/prodigy-define-service-bind-hook)
    #+END_SRC

    Slightly more verbose and a little different, we are able to avoid
    cluttering constructors with =advice-add=. But you should avoid
    advising functions if you can, it messes up the contract with other
    libraries that depend on it and might make things brittle. But when
    you do use it, you should consider asking the author for the advised
    feature and see if you can work things out.

    By saying that, I should have settled on the first approach and not
    complicate things and probably mean more and easier to comprehend
    that there is a customization on the constructor. I might refactor
    my code after making this post. Why did I bother mentioning it? Oh
    well.

  Regardless of hindsight, let's take the second approach since it is
  the decorating behavior we want here. The more important thing is now
  how do we create the keybinding?

