hacker/_posts/2016-10-09-Automatic Prodigy Process Binding.html
---
title: Automatic Prodigy Process Binding
tagline: Automatically process buffer key binding with prodigy
layout: post
author: Francis Murillo
categories: Experiment, Hacker
tags: Emacs
---

<div id="outline-container-orgfc57a53" class="outline-2">
<h2 id="orgfc57a53">Preface</h2>
<div class="outline-text-2" id="text-orgfc57a53">
<p>
It's been quite a long time since I made another post. I have been
quite busy with making an app and making a presentation for my
functional programming group which really ate my attention and
creativity. So for now, let's see what I can come up with a smaller
piece than what I have done before.
</p>
</div>
</div>

<div id="outline-container-orgfe7aec5" class="outline-2">
<h2 id="orgfe7aec5">Problem</h2>
<div class="outline-text-2" id="text-orgfe7aec5">
<p>
If you have been using <a href="https://github.com/rejeep/prodigy.el">prodigy.el</a>, you might get curious on the output
buffer of your services. Assuming you have started the service, there
are two easy ways to check the process buffer out
</p>

<ul class="org-ul">
<li><code>switch-to-buffer</code>
The default way to find any buffer. Whether you use <a href="https://github.com/emacs-helm/helm">helm</a> or <a href="https://github.com/abo-abo/swiper">ivy</a>
or some buffer management technique, you filter out the name of
the process buffer and go.</li>

<li><code>prodigy</code>
The canonical way of finding the process buffers. Once in this
menu buffer, you can search for your process buffer and hit
<code>$</code> (or <code>prodigy-display-process</code>)</li>
</ul>

<p>
But nothing beats a key binding in both scenarios(, unless you can't
memorize key bindings.) So what we want is <b>when we create a service,
we want a key binding associated to opening it's process buffer</b>. Easy
right?
</p>

<p>
I filed an <a href="https://github.com/rejeep/prodigy.el/issues/90">issue</a> for it but I doubt it would be opened so here I am
telling you about it. If you don't want a boring story as usual, here
is the <a href="https://gist.github.com/FrancisMurillo/97eac4b41ef7aa2365bf32a3cac1157c">code</a>. Otherwise, let's get down with the short details.
</p>
</div>
</div>

<div id="outline-container-orgdbb0469" class="outline-2">
<h2 id="orgdbb0469">Decorating The Constructor</h2>
<div class="outline-text-2" id="text-orgdbb0469">
<p>
So in making services, how do we make one? The function is
<code>prodigy-define-service</code>. Let's define one.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span>prodigy-define-service
  <span style="color: #96a5d9; font-style: italic;">:name</span> <span style="color: #68f6cb;">"server"</span>
  <span style="color: #96a5d9; font-style: italic;">:command</span> <span style="color: #68f6cb;">"jekyll"</span>
  <span style="color: #96a5d9; font-style: italic;">:args</span> '<span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"serve"</span><span style="color: #ff1493;">)</span>
  <span style="color: #96a5d9; font-style: italic;">:cwd</span> <span style="color: #68f6cb;">"~/Fakespace/fnlog.io"</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span>prodigy-start-service <span style="color: #ff1493;">(</span>prodigy-find-service <span style="color: #68f6cb;">"server"</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
At the time of writing, this is my minimal <a href="https://jekyllrb.com/">jekyll</a> prodigy service to
serve my blog and to automatically start when it is defined which is
another <a href="https://github.com/rejeep/prodigy.el/issues/38">feature</a> that I desire. Okay, so how do we go about customizing
the constructor? There are two ways again.
</p>

<ul class="org-ul">
<li><p>
Make a custom function constructor
</p>

<p>
This is a safe approach and probably one should lead toward.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">fn/prodigy-define-service</span> <span style="color: #ff1493;">(</span><span style="color: #f5b55f;">&amp;rest</span> args<span style="color: #ff1493;">)</span>
  <span style="color: #68f6cb; font-style: italic;">"A wrapper for `</span><span style="color: #afc0fd; font-weight: bold; font-style: italic;">prodigy-define-service</span><span style="color: #68f6cb; font-style: italic;">' with automatic bindings."</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">let</span> <span style="color: #7fff00;">(</span><span style="color: #00bfff;">(</span>service <span style="color: #ffff00;">(</span>apply #'prodigy-define-service args<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span><span style="color: #96a5d9; font-weight: bold;">prog1</span>
        service
      <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Here is where we strike</span>
      <span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Nothing wrong with this approach. But if you're like me, you sense
this is more <b>function decorating</b> than anything else; then you will
tend to the other way.
</p></li>

<li><p>
Advice the constructor
</p>

<p>
Using the benevolent <code>advice-add</code> construct.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">fn/prodigy-define-service-bind-hook</span> <span style="color: #ff1493;">(</span>orig-fun <span style="color: #f5b55f;">&amp;rest</span> args<span style="color: #ff1493;">)</span>
  <span style="color: #68f6cb; font-style: italic;">"When creating a service, check for a :bind keyword to create an automatic keybinding for it."</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">let</span> <span style="color: #7fff00;">(</span><span style="color: #00bfff;">(</span>result <span style="color: #ffff00;">(</span>apply orig-fun args<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span><span style="color: #96a5d9; font-weight: bold;">prog1</span>
        result
      <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Attack here again</span>
      <span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span>advice-add #'prodigy-define-service <span style="color: #96a5d9; font-style: italic;">:around</span> #'fn/prodigy-define-service-bind-hook<span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Slightly more verbose and a little different, we are able to avoid
cluttering constructors with <code>advice-add</code>. But you should avoid
advising functions if you can, it messes up the contract with other
libraries that depend on it and might make things brittle. But when
you do use it, you should consider asking the author for the advised
feature and see if you can work things out.
</p>

<p>
By saying that, I should have settled on the first approach and not
complicate things and probably mean more and easier to comprehend
that there is a customization on the constructor. I might refactor
my code after making this post. Why did I bother mentioning it? Oh
well.
</p></li>
</ul>

<p>
Regardless of hindsight, let's take the second approach since it is
the decorating behavior we want here. The more important thing is now
how do we create the keybinding?
</p>
</div>
</div>
