hacker/_posts/2016-10-09-Automatic Prodigy Process Binding.org
* Keybinding

  So the canonical way to go about making a key binding is.

  #+BEGIN_SRC emacs-lisp
    (define-key keymap key command)

    (global-set-key key command)  ;; Assuming keymap is global-map

    (define-key global-map (kbd "C-c c c c c") #'garbage-collect)
  #+END_SRC

  So we need three things to make a key binding: the *keymap*, the *key*
  and the *command*. The command is obviously in our case the prodigy
  function which opens the service process buffer. Some digging will
  reveal that it is =prodigy-switch-to-process-buffer= which takes a
  service object, one can confirm it with the following snippet.

  #+BEGIN_SRC emacs-lisp
    (prodigy-switch-to-process-buffer (prodigy-find-service "server"))
  #+END_SRC

  That was quick, now we have the =switch-to-buffer= function for
  prodigy. Let's wrap it for our own use.

  #+BEGIN_SRC emacs-lisp
    (defun fn/prodigy-switch-to-process-buffer (service)
      "Just an wrapper for said function with SERVICE."
      (prodigy-switch-to-process-buffer service))
  #+END_SRC

  So we now have the third part of the recipe, how do we get the others?
  Rather, *how do we define the key binding?* What we is to include some
  extra property or option to the constructor, ideally we want something
  like this.

  #+BEGIN_SRC emacs-lisp
    (prodigy-define-service
      :name "server"
      :command "jekyll"
      :args '("serve")
      :cwd "~/Fakespace/fnlog.io"

      ;; Custom property
      :bind-map global-map
      :bind (kbd "C-c c s")
      )
  #+END_SRC

  Staying true to the constructor, let's define =:bind-map= and =:bind=
  properties in the keyword constructor where it defines =map= and
  =key=, respectively. Two problems might occur if we pass in extra
  attributes in a constructor: it might throw an error because it can't
  dispatch the keyword or drop the superfluous keywords which in both
  cases implies we have to get the keyword values out before it is
  passed in the constructor.

  Thankfully this is not the case, running the snippet above yields the following.

  #+BEGIN_SRC emacs-lisp
    ((:name "server" :command "jekyll" :args ("serve") :cwd "~/Fakespace/fnlog.io" :bind-map "... output omitted ..." :bind "... output omitted ..."))
  #+END_SRC

  It basically returns a list of all the current services where the
  first one is the one we defined. Looking at the data, it is a property
  list where our new keywords our retained. Assuming that let's continue
  with our attack plan.

  #+BEGIN_SRC emacs-lisp
    (let ((result (apply orig-fun args)))
      (prog1
          result
        ;; Actual attack
        (lexical-let* ((service (car result))
            (name (plist-get service :name)) ;; Just for logging
            (bind (plist-get service :bind))
            (bind-map (or (plist-get service :bind-map)
                         global-map)) ;; Default bind-map to the global keymap
            )
          (when bind
            (message "Creating binding for %s" name) ;; Logging
            (define-key bind-map bind
              (lambda ()
                (interactive) ;; This is needed since it is a command
                (fn/prodigy-switch-to-process-buffer service)))))))
  #+END_SRC

  With this implementation we are done. How quick!? So what we did here
  is just extract the relevant pieces we need and just plug it in if
  =bind= is filled in. I guess we're done right?

