hacker/_posts/2016-10-09-Automatic Prodigy Process Binding.html

<div id="outline-container-orgf78a16c" class="outline-2">
<h2 id="orgf78a16c">Keybinding</h2>
<div class="outline-text-2" id="text-orgf78a16c">
<p>
So the canonical way to go about making a key binding is.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span>define-key keymap key command<span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span>global-set-key key command<span style="color: #ff8c00;">)</span>  <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Assuming keymap is global-map</span>

<span style="color: #ff8c00;">(</span>define-key global-map <span style="color: #ff1493;">(</span>kbd <span style="color: #68f6cb;">"C-c c c c c"</span><span style="color: #ff1493;">)</span> #'garbage-collect<span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
So we need three things to make a key binding: the <b>keymap</b>, the <b>key</b>
and the <b>command</b>. The command is obviously in our case the prodigy
function which opens the service process buffer. Some digging will
reveal that it is <code>prodigy-switch-to-process-buffer</code> which takes a
service object, one can confirm it with the following snippet.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span>prodigy-switch-to-process-buffer <span style="color: #ff1493;">(</span>prodigy-find-service <span style="color: #68f6cb;">"server"</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
That was quick, now we have the <code>switch-to-buffer</code> function for
prodigy. Let's wrap it for our own use.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">fn/prodigy-switch-to-process-buffer</span> <span style="color: #ff1493;">(</span>service<span style="color: #ff1493;">)</span>
  <span style="color: #68f6cb; font-style: italic;">"Just an wrapper for said function with SERVICE."</span>
  <span style="color: #ff1493;">(</span>prodigy-switch-to-process-buffer service<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
So we now have the third part of the recipe, how do we get the others?
Rather, <b>how do we define the key binding?</b> What we is to include some
extra property or option to the constructor, ideally we want something
like this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span>prodigy-define-service
  <span style="color: #96a5d9; font-style: italic;">:name</span> <span style="color: #68f6cb;">"server"</span>
  <span style="color: #96a5d9; font-style: italic;">:command</span> <span style="color: #68f6cb;">"jekyll"</span>
  <span style="color: #96a5d9; font-style: italic;">:args</span> '<span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"serve"</span><span style="color: #ff1493;">)</span>
  <span style="color: #96a5d9; font-style: italic;">:cwd</span> <span style="color: #68f6cb;">"~/Fakespace/fnlog.io"</span>

  <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Custom property</span>
  <span style="color: #96a5d9; font-style: italic;">:bind-map</span> global-map
  <span style="color: #96a5d9; font-style: italic;">:bind</span> <span style="color: #ff1493;">(</span>kbd <span style="color: #68f6cb;">"C-c c s"</span><span style="color: #ff1493;">)</span>
  <span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Staying true to the constructor, let's define <code>:bind-map</code> and <code>:bind</code>
properties in the keyword constructor where it defines <code>map</code> and
<code>key</code>, respectively. Two problems might occur if we pass in extra
attributes in a constructor: it might throw an error because it can't
dispatch the keyword or drop the superfluous keywords which in both
cases implies we have to get the keyword values out before it is
passed in the constructor.
</p>

<p>
Thankfully this is not the case, running the snippet above yields the following.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-style: italic;">:name</span> <span style="color: #68f6cb;">"server"</span> <span style="color: #96a5d9; font-style: italic;">:command</span> <span style="color: #68f6cb;">"jekyll"</span> <span style="color: #96a5d9; font-style: italic;">:args</span> <span style="color: #7fff00;">(</span><span style="color: #68f6cb;">"serve"</span><span style="color: #7fff00;">)</span> <span style="color: #96a5d9; font-style: italic;">:cwd</span> <span style="color: #68f6cb;">"~/Fakespace/fnlog.io"</span> <span style="color: #96a5d9; font-style: italic;">:bind-map</span> <span style="color: #68f6cb;">"... output omitted ..."</span> <span style="color: #96a5d9; font-style: italic;">:bind</span> <span style="color: #68f6cb;">"... output omitted ..."</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
It basically returns a list of all the current services where the
first one is the one we defined. Looking at the data, it is a property
list where our new keywords our retained. Assuming that let's continue
with our attack plan.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">let</span> <span style="color: #ff1493;">(</span><span style="color: #7fff00;">(</span>result <span style="color: #00bfff;">(</span>apply orig-fun args<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">prog1</span>
      result
    <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Actual attack</span>
    <span style="color: #7fff00;">(</span><span style="color: #96a5d9; font-weight: bold;">lexical-let*</span> <span style="color: #00bfff;">(</span><span style="color: #ffff00;">(</span>service <span style="color: #da70d6;">(</span>car result<span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span>
        <span style="color: #ffff00;">(</span>name <span style="color: #da70d6;">(</span>plist-get service <span style="color: #96a5d9; font-style: italic;">:name</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span> <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Just for logging</span>
        <span style="color: #ffff00;">(</span>bind <span style="color: #da70d6;">(</span>plist-get service <span style="color: #96a5d9; font-style: italic;">:bind</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span>
        <span style="color: #ffff00;">(</span>bind-map <span style="color: #da70d6;">(</span><span style="color: #96a5d9; font-weight: bold;">or</span> <span style="color: #00ff7f;">(</span>plist-get service <span style="color: #96a5d9; font-style: italic;">:bind-map</span><span style="color: #00ff7f;">)</span>
                     global-map<span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span> <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Default bind-map to the global keymap</span>
        <span style="color: #00bfff;">)</span>
      <span style="color: #00bfff;">(</span><span style="color: #96a5d9; font-weight: bold;">when</span> bind
        <span style="color: #ffff00;">(</span>message <span style="color: #68f6cb;">"Creating binding for %s"</span> name<span style="color: #ffff00;">)</span> <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Logging</span>
        <span style="color: #ffff00;">(</span>define-key bind-map bind
          <span style="color: #da70d6;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #00ff7f;">()</span>
            <span style="color: #00ff7f;">(</span><span style="color: #96a5d9; font-weight: bold;">interactive</span><span style="color: #00ff7f;">)</span> <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">This is needed since it is a command</span>
            <span style="color: #00ff7f;">(</span>fn/prodigy-switch-to-process-buffer service<span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
With this implementation we are done. How quick!? So what we did here
is just extract the relevant pieces we need and just plug it in if
<code>bind</code> is filled in. I guess we're done right?
</p>
</div>
</div>
