hacker/_posts/2016-10-09-Automatic Prodigy Process Binding.org
* Cleanliness

  There is one more enhancement is we can do is to name the view
  function. Since we are defining an anonymous command, we can't reuse
  the command unless you are in favor of =command-execute-key=. And if
  you use =which-key= and whenever the command is displayed or queried,
  it just says =lambda= or something unhelpful. So this optional section
  is primarily just for that. So let's refactor the anonymous command.

  First, how do we define the command name? We can either ask for it via
  =:bind-command-name= keyword or generate it ourselves. We can create
  a quick and safe symbol with =gensym= like so.

  #+BEGIN_SRC emacs-lisp
    (gensym "symbol-prefix") ;; symbol-prefix800
  #+END_SRC

  We can use that to create a symbol given a prefix. Which in turn is a
  good idea, to give our command a prefix or namespace. As for me, I use
  the prefix =fn/=. So let's put an option to define our namespace.

  #+BEGIN_SRC emacs-lisp
    (defvar fn/prodigy-command-name-prefix "fn/"
      "The prefix when creating binding prodigy view commands.")
  #+END_SRC

  Ideally, our command name is prefix plus the bind command name. Which
  is easy to work with.

  #+BEGIN_SRC emacs-lisp
    (lexical-let* ((service-name (plist-get service :name))
        (command-name (or (plist-get service :bind-command-name)
                         (symbol-name (gensym "prodigy-view-"))))
        (function-symbol (intern (format "%s%s" fn/prodigy-command-name-prefix command-name)))
        (service service))
      ;; How do we create our named command?
      )
  #+END_SRC

  Lastly, we need to create our function. If you're thinking we should
  use =defun= with an =interactive= spec, then it is slightly more
  complicated than just using =fset= with an anonymous command by a
  backtick.

  #+BEGIN_SRC emacs-lisp
    (fset my-interned-function-symbol
          `(lambda ()
             ,(format "A prodigy view function for %s" service-name)
             (interactive)
             (fn/prodigy-switch-to-process-buffer (quote ,service))))
  #+END_SRC

  This is a nice template of wrapping a function into a command. When I
  was thinking about it, I knew =fset= is the go to function when you
  want it to be found or discovered aside from =defun=; the other thing
  I found some difficulty is using backtick. If you didn't use a
  backtick, you can't add the documentation string which is a minor
  detail or did I just complicate myself again? Oh well.

  With that we can wrap it up in a neat bow.

  #+BEGIN_SRC emacs-lisp
    (defun fn/prodigy-prepared-switch-to-process-buffer (service)
      "Another wrapper to make specific functions for viewing SERVICE."
      (lexical-let* ((service-name (plist-get service :name))
          (command-name (or (plist-get service :bind-command-name)
                           (symbol-name (gensym "prodigy-view-"))))
          (prefix "fmpv/")
          (function-symbol (intern (format "%s%s" prefix command-name)))
          (service service))
        (fset function-symbol
              `(lambda ()
                 ,(format "A prodigy view function for %s" service-name)
                 (interactive)
                 (fn/prodigy-switch-to-process-buffer (quote ,service))))
        function-symbol))
  #+END_SRC

  Going back to our original function.

  #+BEGIN_SRC emacs-lisp
    (defun fn/prodigy-define-service-bind-hook (define-service &rest args)
      "When creating a service, check for a :bind keyword to create an automatic keybinding for it."
      (let ((result (apply define-service args)))
        (prog1
            result
          (let* ((service (car result))
              (name (plist-get service :name))
              (bind (plist-get service :bind))
              (bind-map (or (plist-get service :bind-map) global-map)))
            (when bind
              (message "Creating binding for %s" name)
              (define-key bind-map bind
                (fn/prodigy-prepared-switch-to-process-buffer service)))))))

    (advice-add #'prodigy-define-service :around #'fn/prodigy-define-service-bind-hook)
  #+END_SRC

  And that's pretty much it and in action.

  #+BEGIN_SRC emacs-lisp
    (prodigy-define-service
      :name "server"
      :command "jekyll"
      :args '("serve")
      :cwd "~/Fakespace/fnlog.io"

      ;; Custom property
      :bind-command-name "server-jekyll"
      :bind-map global-map
      :bind (kbd "C-c c s")
      )
  #+END_SRC

  This creates the command =fn/server-jekyll= which is bound to =C-c c
  s=. Success!

