hacker/_posts/2016-10-09-Automatic Prodigy Process Binding.html

<div id="outline-container-org12c0c30" class="outline-2">
<h2 id="org12c0c30">Cleanliness</h2>
<div class="outline-text-2" id="text-org12c0c30">
<p>
There is one more enhancement is we can do is to name the view
function. Since we are defining an anonymous command, we can't reuse
the command unless you are in favor of <code>command-execute-key</code>. And if
you use <code>which-key</code> and whenever the command is displayed or queried,
it just says <code>lambda</code> or something unhelpful. So this optional section
is primarily just for that. So let's refactor the anonymous command.
</p>

<p>
First, how do we define the command name? We can either ask for it via
<code>:bind-command-name</code> keyword or generate it ourselves. We can create
a quick and safe symbol with <code>gensym</code> like so.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span>gensym <span style="color: #68f6cb;">"symbol-prefix"</span><span style="color: #ff8c00;">)</span> <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">symbol-prefix800</span>
</pre>
</div>

<p>
We can use that to create a symbol given a prefix. Which in turn is a
good idea, to give our command a prefix or namespace. As for me, I use
the prefix <code>fn/</code>. So let's put an option to define our namespace.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defvar</span> <span style="color: #ff694d;">fn/prodigy-command-name-prefix</span> <span style="color: #68f6cb;">"fn/"</span>
  <span style="color: #68f6cb; font-style: italic;">"The prefix when creating binding prodigy view commands."</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Ideally, our command name is prefix plus the bind command name. Which
is easy to work with.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">lexical-let*</span> <span style="color: #ff1493;">(</span><span style="color: #7fff00;">(</span>service-name <span style="color: #00bfff;">(</span>plist-get service <span style="color: #96a5d9; font-style: italic;">:name</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span>command-name <span style="color: #00bfff;">(</span><span style="color: #96a5d9; font-weight: bold;">or</span> <span style="color: #ffff00;">(</span>plist-get service <span style="color: #96a5d9; font-style: italic;">:bind-command-name</span><span style="color: #ffff00;">)</span>
                     <span style="color: #ffff00;">(</span>symbol-name <span style="color: #da70d6;">(</span>gensym <span style="color: #68f6cb;">"prodigy-view-"</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span>function-symbol <span style="color: #00bfff;">(</span>intern <span style="color: #ffff00;">(</span>format <span style="color: #68f6cb;">"%s%s"</span> fn/prodigy-command-name-prefix command-name<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span>service service<span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span>
  <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">How do we create our named command?</span>
  <span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Lastly, we need to create our function. If you're thinking we should
use <code>defun</code> with an <code>interactive</code> spec, then it is slightly more
complicated than just using <code>fset</code> with an anonymous command by a
backtick.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span>fset my-interned-function-symbol
      `<span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #7fff00;">()</span>
         ,<span style="color: #7fff00;">(</span>format <span style="color: #68f6cb;">"A prodigy view function for %s"</span> service-name<span style="color: #7fff00;">)</span>
         <span style="color: #7fff00;">(</span><span style="color: #96a5d9; font-weight: bold;">interactive</span><span style="color: #7fff00;">)</span>
         <span style="color: #7fff00;">(</span>fn/prodigy-switch-to-process-buffer <span style="color: #00bfff;">(</span><span style="color: #96a5d9; font-weight: bold;">quote</span> ,service<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
This is a nice template of wrapping a function into a command. When I
was thinking about it, I knew <code>fset</code> is the go to function when you
want it to be found or discovered aside from <code>defun</code>; the other thing
I found some difficulty is using backtick. If you didn't use a
backtick, you can't add the documentation string which is a minor
detail or did I just complicate myself again? Oh well.
</p>

<p>
With that we can wrap it up in a neat bow.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">fn/prodigy-prepared-switch-to-process-buffer</span> <span style="color: #ff1493;">(</span>service<span style="color: #ff1493;">)</span>
  <span style="color: #68f6cb; font-style: italic;">"Another wrapper to make specific functions for viewing SERVICE."</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">lexical-let*</span> <span style="color: #7fff00;">(</span><span style="color: #00bfff;">(</span>service-name <span style="color: #ffff00;">(</span>plist-get service <span style="color: #96a5d9; font-style: italic;">:name</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
      <span style="color: #00bfff;">(</span>command-name <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">or</span> <span style="color: #da70d6;">(</span>plist-get service <span style="color: #96a5d9; font-style: italic;">:bind-command-name</span><span style="color: #da70d6;">)</span>
                       <span style="color: #da70d6;">(</span>symbol-name <span style="color: #00ff7f;">(</span>gensym <span style="color: #68f6cb;">"prodigy-view-"</span><span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
      <span style="color: #00bfff;">(</span>prefix <span style="color: #68f6cb;">"fmpv/"</span><span style="color: #00bfff;">)</span>
      <span style="color: #00bfff;">(</span>function-symbol <span style="color: #ffff00;">(</span>intern <span style="color: #da70d6;">(</span>format <span style="color: #68f6cb;">"%s%s"</span> prefix command-name<span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span>
      <span style="color: #00bfff;">(</span>service service<span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span>fset function-symbol
          `<span style="color: #00bfff;">(</span><span style="color: #96a5d9; font-weight: bold;">lambda</span> <span style="color: #ffff00;">()</span>
             ,<span style="color: #ffff00;">(</span>format <span style="color: #68f6cb;">"A prodigy view function for %s"</span> service-name<span style="color: #ffff00;">)</span>
             <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">interactive</span><span style="color: #ffff00;">)</span>
             <span style="color: #ffff00;">(</span>fn/prodigy-switch-to-process-buffer <span style="color: #da70d6;">(</span><span style="color: #96a5d9; font-weight: bold;">quote</span> ,service<span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    function-symbol<span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
Going back to our original function.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span><span style="color: #96a5d9; font-weight: bold;">defun</span> <span style="color: #bad6e2;">fn/prodigy-define-service-bind-hook</span> <span style="color: #ff1493;">(</span>define-service <span style="color: #f5b55f;">&amp;rest</span> args<span style="color: #ff1493;">)</span>
  <span style="color: #68f6cb; font-style: italic;">"When creating a service, check for a :bind keyword to create an automatic keybinding for it."</span>
  <span style="color: #ff1493;">(</span><span style="color: #96a5d9; font-weight: bold;">let</span> <span style="color: #7fff00;">(</span><span style="color: #00bfff;">(</span>result <span style="color: #ffff00;">(</span>apply define-service args<span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span>
    <span style="color: #7fff00;">(</span><span style="color: #96a5d9; font-weight: bold;">prog1</span>
        result
      <span style="color: #00bfff;">(</span><span style="color: #96a5d9; font-weight: bold;">let*</span> <span style="color: #ffff00;">(</span><span style="color: #da70d6;">(</span>service <span style="color: #00ff7f;">(</span>car result<span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span>
          <span style="color: #da70d6;">(</span>name <span style="color: #00ff7f;">(</span>plist-get service <span style="color: #96a5d9; font-style: italic;">:name</span><span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span>
          <span style="color: #da70d6;">(</span>bind <span style="color: #00ff7f;">(</span>plist-get service <span style="color: #96a5d9; font-style: italic;">:bind</span><span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span>
          <span style="color: #da70d6;">(</span>bind-map <span style="color: #00ff7f;">(</span><span style="color: #96a5d9; font-weight: bold;">or</span> <span style="color: #ff8247;">(</span>plist-get service <span style="color: #96a5d9; font-style: italic;">:bind-map</span><span style="color: #ff8247;">)</span> global-map<span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span>
        <span style="color: #ffff00;">(</span><span style="color: #96a5d9; font-weight: bold;">when</span> bind
          <span style="color: #da70d6;">(</span>message <span style="color: #68f6cb;">"Creating binding for %s"</span> name<span style="color: #da70d6;">)</span>
          <span style="color: #da70d6;">(</span>define-key bind-map bind
            <span style="color: #00ff7f;">(</span>fn/prodigy-prepared-switch-to-process-buffer service<span style="color: #00ff7f;">)</span><span style="color: #da70d6;">)</span><span style="color: #ffff00;">)</span><span style="color: #00bfff;">)</span><span style="color: #7fff00;">)</span><span style="color: #ff1493;">)</span><span style="color: #ff8c00;">)</span>

<span style="color: #ff8c00;">(</span>advice-add #'prodigy-define-service <span style="color: #96a5d9; font-style: italic;">:around</span> #'fn/prodigy-define-service-bind-hook<span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
And that's pretty much it and in action.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #ff8c00;">(</span>prodigy-define-service
  <span style="color: #96a5d9; font-style: italic;">:name</span> <span style="color: #68f6cb;">"server"</span>
  <span style="color: #96a5d9; font-style: italic;">:command</span> <span style="color: #68f6cb;">"jekyll"</span>
  <span style="color: #96a5d9; font-style: italic;">:args</span> '<span style="color: #ff1493;">(</span><span style="color: #68f6cb;">"serve"</span><span style="color: #ff1493;">)</span>
  <span style="color: #96a5d9; font-style: italic;">:cwd</span> <span style="color: #68f6cb;">"~/Fakespace/fnlog.io"</span>

  <span style="color: #2872b2;">;; </span><span style="color: #2872b2;">Custom property</span>
  <span style="color: #96a5d9; font-style: italic;">:bind-command-name</span> <span style="color: #68f6cb;">"server-jekyll"</span>
  <span style="color: #96a5d9; font-style: italic;">:bind-map</span> global-map
  <span style="color: #96a5d9; font-style: italic;">:bind</span> <span style="color: #ff1493;">(</span>kbd <span style="color: #68f6cb;">"C-c c s"</span><span style="color: #ff1493;">)</span>
  <span style="color: #ff8c00;">)</span>
</pre>
</div>

<p>
This creates the command <code>fn/server-jekyll</code> which is bound to <code>C-c c
  s</code>. Success!
</p>
</div>
</div>
