hacker/_posts/2016-10-09-Automatic Prodigy Process Binding.org
* Closing Words

  For now I am pretty happy with the implementation, I can jump to any
  prodigy service I defined quickly. There is one thing one can ask from
  the author is that how the prodigy buffer is displayed. Like with this
  [[https://github.com/rejeep/prodigy.el/issues/73][feature]], the process buffer appears in the other window. Not a big
  deal.

  And with this, I may have no reason to visit the prodigy buffer itself
  aside from starting services up. If you wanted to go one up, you could
  automatically start a service you visit, which you can decorate the
  process switch function. The other feature I came up along with[[https://github.com/pashinin/workgroups2][
  workgroups2]] is to set the default filter per workgroup. For example, I
  have five workgroups and each one has a prodigy service tightly tied
  with it, I don't need to see the other services in the prodigy buffer
  since it does not relate to the workgroup.

  I wonder what other prodigy features can be made possible.
