hacker/_posts/2016-10-09-Automatic Prodigy Process Binding.html

<div id="outline-container-org8b9644d" class="outline-2">
<h2 id="org8b9644d">Closing Words</h2>
<div class="outline-text-2" id="text-org8b9644d">
<p>
For now I am pretty happy with the implementation, I can jump to any
prodigy service I defined quickly. There is one thing one can ask from
the author is that how the prodigy buffer is displayed. Like with this
<a href="https://github.com/rejeep/prodigy.el/issues/73">feature</a>, the process buffer appears in the other window. Not a big
deal.
</p>

<p>
And with this, I may have no reason to visit the prodigy buffer itself
aside from starting services up. If you wanted to go one up, you could
automatically start a service you visit, which you can decorate the
process switch function. The other feature I came up along with<a href="https://github.com/pashinin/workgroups2">
workgroups2</a> is to set the default filter per workgroup. For example, I
have five workgroups and each one has a prodigy service tightly tied
with it, I don't need to see the other services in the prodigy buffer
since it does not relate to the workgroup.
</p>

<p>
I wonder what other prodigy features can be made possible.
</p>
</div>
</div>
